
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>1-数据库基础 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../ch3-spring/0-spring.html" />
    
    
    <link rel="prev" href="0-数据库.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../ch1-java/0-java基础.html">
            
                <a href="../ch1-java/0-java基础.html">
            
                    
                    java
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../ch1-java/1-java运行时数据区.html">
            
                <a href="../ch1-java/1-java运行时数据区.html">
            
                    
                    1-java运行时数据区
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../ch1-java/2-java内存模型与垃圾回收机制.html">
            
                <a href="../ch1-java/2-java内存模型与垃圾回收机制.html">
            
                    
                    2-java内存模型与垃圾回收机制
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../ch1-java/3-nio入门.html">
            
                <a href="../ch1-java/3-nio入门.html">
            
                    
                    3-nio入门
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="../ch1-java/4-类加载机制.html">
            
                <a href="../ch1-java/4-类加载机制.html">
            
                    
                    4-java类加载机制
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="../ch1-java/5-反射.html">
            
                <a href="../ch1-java/5-反射.html">
            
                    
                    5-反射
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.6" data-path="../ch1-java/6-静态代理与动态代理.html">
            
                <a href="../ch1-java/6-静态代理与动态代理.html">
            
                    
                    6-静态代理与动态代理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.7" data-path="../ch1-java/7-java多线程.html">
            
                <a href="../ch1-java/7-java多线程.html">
            
                    
                    7-java多线程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.8" data-path="../ch1-java/8-java容器.html">
            
                <a href="../ch1-java/8-java容器.html">
            
                    
                    8-java容器
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="0-数据库.html">
            
                <a href="0-数据库.html">
            
                    
                    数据库
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.3.1" data-path="1-数据库基础.html">
            
                <a href="1-数据库基础.html">
            
                    
                    1-数据库基础
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../ch3-spring/0-spring.html">
            
                <a href="../ch3-spring/0-spring.html">
            
                    
                    Spring
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../ch3-spring/1-spring基础.html">
            
                <a href="../ch3-spring/1-spring基础.html">
            
                    
                    1-Spring基础知识
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../ch4-OS/0-操作系统.html">
            
                <a href="../ch4-OS/0-操作系统.html">
            
                    
                    操作系统
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="../ch4-OS/1-操作系统基础.html">
            
                <a href="../ch4-OS/1-操作系统基础.html">
            
                    
                    1-操作系统基础
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >1-数据库基础</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x4E00;&#x3001;&#x4E8B;&#x52A1;">&#x4E00;&#x3001;&#x4E8B;&#x52A1;</h1>
<p><strong>&#x4E8B;&#x52A1;&#xFF1A;</strong>&#x7531;&#x4E00;&#x7CFB;&#x5217;&#x5BF9;&#x7CFB;&#x7EDF;&#x4E2D;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x8BBF;&#x95EE;&#x4E0E;&#x66F4;&#x65B0;&#x7684;&#x64CD;&#x4F5C;&#x6240;&#x7EC4;&#x6210;&#x7684;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x903B;&#x8F91;&#x5355;&#x5143;&#xFF0C;&#x72ED;&#x4E49;&#x4E0A;&#x7684;&#x4E8B;&#x52A1;&#x7279;&#x8D28;&#x6570;&#x636E;&#x5E93;&#x4E8B;&#x52A1;&#x3002;</p>
<p><strong>ACID&#xFF1A;</strong>&#x4E8B;&#x52A1;&#x7684;&#x56DB;&#x4E2A;&#x7279;&#x5F81;&#xFF0C;&#x539F;&#x5B50;&#x6027;&#xFF08;Atomicity&#xFF09;&#x3001;&#x4E00;&#x81F4;&#x6027;&#xFF08;Consistency&#xFF09;&#x3001;&#x9694;&#x79BB;&#x6027;&#xFF08;Isolation&#xFF09;&#x3001;&#x6301;&#x4E45;&#x6027;&#xFF08;Durability&#xFF09;</p>
<ol>
<li><strong>&#x539F;&#x5B50;&#x6027;&#xFF1A;</strong>&#x5168;&#x90E8;&#x6267;&#x884C;&#x6216;&#x5168;&#x90E8;&#x4E0D;&#x6267;&#x884C;</li>
<li><strong>&#x4E00;&#x81F4;&#x6027;&#xFF1A;</strong>&#x4E8B;&#x52A1;&#x7684;&#x6267;&#x884C;&#x4E0D;&#x80FD;&#x7834;&#x574F;&#x6570;&#x636E;&#x5E93;&#x6570;&#x636E;&#x7684;&#x5B8C;&#x6574;&#x6027;&#x548C;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x5728;&#x6267;&#x884C;&#x4E4B;&#x524D;&#x548C;&#x6267;&#x884C;&#x4E4B;&#x540E;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x5076;&#x8BFB;&#x5FC5;&#x987B;&#x5904;&#x4E8E;&#x4E00;&#x81F4;&#x6027;&#x72B6;&#x6001;</li>
<li><strong>&#x9694;&#x79BB;&#x6027;&#xFF1A;</strong>&#x5E76;&#x53D1;&#x7684;&#x4E8B;&#x52A1;&#x4E92;&#x76F8;&#x9694;&#x79BB;&#xFF0C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x7684;&#x6267;&#x884C;&#x4E0D;&#x80FD;&#x88AB;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x5E72;&#x6270;&#x3002;</li>
<li><strong>&#x6301;&#x4E45;&#x6027;</strong>&#xFF1A;&#x6307;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4E00;&#x65E6;&#x63D0;&#x4EA4;&#xFF0C;&#x5B83;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5BF9;&#x5E94;&#x6570;&#x636E;&#x7684;&#x72B6;&#x6001;&#x53D8;&#x66F4;&#x5C31;&#x662F;&#x6C38;&#x4E45;&#x6027;&#x7684;&#x3002;&#x5373;&#x4F7F;&#x53D1;&#x751F;&#x7CFB;&#x7EDF;&#x5D29;&#x6E83;&#x6216;&#x673A;&#x5668;&#x5B95;&#x673A;&#x7B49;&#x6545;&#x969C;&#xFF0C;&#x53EA;&#x8981;&#x6570;&#x636E;&#x5E93;&#x80FD;&#x591F;&#x91CD;&#x65B0;&#x542F;&#x52A8;&#xFF0C;&#x90A3;&#x4E48;&#x4E00;&#x5B9A;&#x80FD;&#x591F;&#x5C06;&#x5176;&#x6062;&#x590D;&#x5230;&#x4E8B;&#x52A1;&#x6210;&#x529F;&#x7ED3;&#x675F;&#x65F6;&#x7684;&#x72B6;&#x6001;&#x3002;</li>
</ol>
<p><strong>&#x4E8B;&#x52A1;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#xFF1A;</strong></p>
<ol>
<li>&#x8BFB;&#x672A;&#x63D0;&#x4EA4;&#xFF08;&#x672A;&#x6388;&#x6743;&#x8BFB;&#x53D6;&#xFF09;&#xFF1A;&#x5141;&#x8BB8;&#x810F;&#x8BFB;&#xFF0C;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x6700;&#x4F4E;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x6B63;&#x5728;&#x5904;&#x7406;&#x67D0;&#x4E00;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x4E86;&#x66F4;&#x65B0;&#xFF0C;&#x4F46;&#x540C;&#x65F6;&#x5C1A;&#x672A;&#x5B8C;&#x6210;&#x4E8B;&#x52A1;&#xFF0C;&#x56E0;&#x6B64;&#x8FD8;&#x6CA1;&#x6709;&#x8FDB;&#x884C;&#x4E8B;&#x52A1;&#x63D0;&#x4EA4;&#xFF1B;&#x800C;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;&#x5141;&#x8BB8;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4E5F;&#x80FD;&#x591F;&#x8BBF;&#x95EE;&#x8BE5;&#x6570;&#x636E;&#x3002;</li>
<li>&#x6388;&#x6743;&#x8BFB;&#x53D6;&#xFF08;&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;&#xFF09;&#xFF1A;&#x53EA;&#x5141;&#x8BB8;&#x8BFB;&#x5DF2;&#x7ECF;&#x88AB;&#x63D0;&#x4EA4;&#x7684;&#x6570;&#x636E;&#x3002;</li>
<li>&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#xFF1A;&#x5728;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x591A;&#x6B21;&#x8BFB;&#x53D6;&#x540C;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x5176;&#x503C;&#x90FD;&#x548C;&#x4E8B;&#x52A1;&#x5F00;&#x59CB;&#x65F6;&#x523B;&#x662F;&#x4E00;&#x81F4;&#x7684;&#x3002;&#x56E0;&#x6B64;&#x8BE5;&#x7EA7;&#x522B;&#x7981;&#x6B62;&#x4E86;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x53D6;&#x548C;&#x810F;&#x8BFB;&#x3002;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x5E7B;&#x8BFB;&#x3002;</li>
<li>&#x4E32;&#x884C;&#x5316;&#xFF1A;&#x6700;&#x4E25;&#x683C;&#x3002;&#x8981;&#x6C42;&#x6240;&#x6709;&#x4E8B;&#x52A1;&#x90FD;&#x88AB;&#x7A7F;&#x884C;&#x6267;&#x884C;&#x3002;</li>
</ol>
<blockquote>
<p><strong>&#x5E7B;&#x8BFB;&#xFF0C;</strong>&#x5E76;&#x4E0D;&#x662F;&#x8BF4;&#x4E24;&#x6B21;&#x8BFB;&#x53D6;&#x83B7;&#x53D6;&#x7684;&#x7ED3;&#x679C;&#x96C6;&#x4E0D;&#x540C;&#xFF0C;&#x5E7B;&#x8BFB;&#x4FA7;&#x91CD;&#x7684;&#x65B9;&#x9762;&#x662F;&#x67D0;&#x4E00;&#x6B21;&#x7684; <strong>select</strong>&#x64CD;&#x4F5C;&#x5F97;&#x5230;&#x7684;&#x7ED3;&#x679C;&#x6240;&#x8868;&#x5F81;&#x7684;&#x6570;&#x636E;&#x72B6;&#x6001;&#x65E0;&#x6CD5;&#x652F;&#x6491;&#x540E;&#x7EED;&#x7684;&#x4E1A;&#x52A1;&#x64CD;&#x4F5C;&#x3002;&#x66F4;&#x4E3A;&#x5177;&#x4F53;&#x4E00;&#x4E9B;&#xFF1A;<strong>select</strong> &#x67D0;&#x8BB0;&#x5F55;&#x662F;&#x5426;&#x5B58;&#x5728;&#xFF0C;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x51C6;&#x5907;&#x63D2;&#x5165;&#x6B64;&#x8BB0;&#x5F55;&#xFF0C;&#x4F46;&#x6267;&#x884C; <strong>insert</strong> &#x65F6;&#x53D1;&#x73B0;&#x6B64;&#x8BB0;&#x5F55;&#x5DF2;&#x5B58;&#x5728;&#xFF0C;&#x65E0;&#x6CD5;&#x63D2;&#x5165;&#xFF0C;&#x6B64;&#x65F6;&#x5C31;&#x53D1;&#x751F;&#x4E86;&#x5E7B;&#x8BFB;&#x3002;</p>
</blockquote>
<p><strong>Redo&#x3001;Undo&#x65E5;&#x5FD7;</strong></p>
<p>redo log &#x662F;&#x91CD;&#x505A;&#x65E5;&#x5FD7;&#xFF0C;&#x63D0;&#x4F9B;<strong>&#x524D;&#x6EDA;</strong>&#x64CD;&#x4F5C;&#xFF1B;undo log &#x662F;&#x56DE;&#x9000;&#x65E5;&#x5FD7;&#xFF0C;&#x63D0;&#x4F9B;<strong>&#x56DE;&#x6EDA;</strong>&#x64CD;&#x4F5C;&#x3002;</p>
<ol>
<li>redo log &#x901A;&#x5E38;&#x662F; <strong>&#x7269;&#x7406;</strong> &#x65E5;&#x5FD7;&#xFF0C;&#x8BB0;&#x5F55;&#x7684;&#x662F; <strong>&#x6570;&#x636E;&#x9875;</strong>      &#x7684;&#x7269;&#x7406;&#x4FEE;&#x6539;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x67D0;&#x4E00;&#x884C;&#x6216;&#x67D0;&#x51E0;&#x884C;&#x4FEE;&#x6539;&#x6210;&#x600E;&#x6837;&#x600E;&#x6837;&#xFF0C;&#x5B83;&#x7528;&#x6765;&#x6062;&#x590D;&#x63D0;&#x4EA4;&#x540E;&#x7684;&#x7269;&#x7406;&#x6570;&#x636E;&#x9875;(&#x6062;&#x590D;&#x6570;&#x636E;&#x9875;&#xFF0C;&#x4E14;&#x53EA;&#x80FD;&#x6062;&#x590D;&#x5230;&#x6700;&#x540E;&#x4E00;&#x6B21;&#x63D0;&#x4EA4;&#x7684;&#x4F4D;&#x7F6E;)&#x3002;</li>
<li>undo log &#x7528;&#x6765;&#x56DE;&#x6EDA;&#x884C;&#x8BB0;&#x5F55;&#x5230;&#x67D0;&#x4E2A;&#x7248;&#x672C;&#x3002;undo log      &#x4E00;&#x822C;&#x662F;&#x903B;&#x8F91;&#x65E5;&#x5FD7;&#xFF0C;&#x6839;&#x636E;&#x6BCF;&#x884C;&#x8BB0;&#x5F55;&#x8FDB;&#x884C;&#x8BB0;&#x5F55;&#x3002;</li>
</ol>
<h1 id="&#x4E8C;&#x3001;mysql&#x5B58;&#x50A8;&#x5F15;&#x64CE;">&#x4E8C;&#x3001;MySQL&#x5B58;&#x50A8;&#x5F15;&#x64CE;</h1>
<ul>
<li>MyISAM &#x4E0D;&#x652F;&#x6301;&#x4E8B;&#x52A1;&#xFF0C;InnoDB &#x662F;&#x4E8B;&#x52A1;&#x7C7B;&#x578B;&#x7684;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#xFF1B;</li>
<li>MyISAM &#x53EA;&#x652F;&#x6301;&#x8868;&#x7EA7;&#x9501;&#xFF0C;BDB      &#x652F;&#x6301;&#x9875;&#x7EA7;&#x9501;&#x548C;&#x8868;&#x7EA7;&#x9501;&#xFF0C;&#x9ED8;&#x8BA4;&#x4E3A;&#x9875;&#x7EA7;&#x9501;&#xFF1B;&#x800C; InnoDB &#x652F;&#x6301;&#x884C;&#x7EA7;&#x9501;&#x548C;&#x8868;&#x7EA7;&#x9501;&#xFF0C;&#x9ED8;&#x8BA4;&#x4E3A;&#x884C;&#x7EA7;&#x9501;&#xFF1B;</li>
<li>MyISAM &#x5F15;&#x64CE;&#x4E0D;&#x652F;&#x6301;&#x5916;&#x952E;&#xFF0C;InnoDB &#x652F;&#x6301;&#x5916;&#x952E;&#xFF1B;</li>
<li>MyISAM &#x5F15;&#x64CE;&#x7684;&#x8868;&#x5728;&#x5927;&#x91CF;&#x9AD8;&#x5E76;&#x53D1;&#x7684;&#x8BFB;&#x5199;&#x4E0B;&#x4F1A;&#x7ECF;&#x5E38;&#x51FA;&#x73B0;&#x8868;&#x635F;&#x574F;&#x7684;&#x60C5;&#x51B5;&#xFF1B;</li>
<li>&#x5BF9;&#x4E8E; count( ) &#x67E5;&#x8BE2;&#x6765;&#x8BF4; MyISAM &#x66F4;&#x6709;&#x4F18;&#x52BF;&#xFF1B;</li>
<li>InnoDB &#x662F;&#x4E3A;&#x5904;&#x7406;&#x5DE8;&#x5927;&#x6570;&#x636E;&#x91CF;&#x65F6;&#x7684;&#x6700;&#x5927;&#x6027;&#x80FD;&#x8BBE;&#x8BA1;&#xFF0C;&#x5B83;&#x7684; CPU      &#x6548;&#x7387;&#x53EF;&#x80FD;&#x662F;&#x4EFB;&#x4F55;&#x5176;&#x5B83;&#x57FA;&#x4E8E;&#x78C1;&#x76D8;&#x7684;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x5F15;&#x64CE;&#x6240;&#x4E0D;&#x80FD;&#x5339;&#x654C;&#x7684;&#xFF1B;</li>
<li>MyISAM &#x652F;&#x6301;&#x5168;&#x6587;&#x7D22;&#x5F15;&#xFF08;FULLTEXT&#xFF09;&#xFF0C;InnoDB      &#x4E0D;&#x652F;&#x6301;&#xFF1B;</li>
<li>MyISAM &#x5F15;&#x64CE;&#x7684;&#x8868;&#x7684;&#x67E5;&#x8BE2;&#x3001;&#x66F4;&#x65B0;&#x3001;&#x63D2;&#x5165;&#x7684;&#x6548;&#x7387;&#x8981;&#x6BD4; InnoDB   &#x9AD8;&#x3002;</li>
</ul>
<p><strong>&#x6700;&#x4E3B;&#x8981;&#x7684;&#x533A;&#x522B;&#x662F;&#xFF1A;</strong>MyISAM &#x8868;&#x4E0D;&#x652F;&#x6301;&#x4E8B;&#x52A1;&#x3001;&#x4E0D;&#x652F;&#x6301;&#x884C;&#x7EA7;&#x9501;&#x3001;&#x4E0D;&#x652F;&#x6301;&#x5916;&#x952E;&#x3002; InnoDB &#x8868;&#x652F;&#x6301;&#x4E8B;&#x52A1;&#x3001;&#x652F;&#x6301;&#x884C;&#x7EA7;&#x9501;&#x3001;&#x652F;&#x6301;&#x5916;&#x952E;&#x3002;&#xFF08;&#x53EF;&#x76F4;&#x63A5;&#x56DE;&#x7B54;&#x8FD9;&#x4E2A;&#xFF09;</p>
<h1 id="&#x4E09;&#x3001;&#x4E09;&#x5927;&#x8303;&#x5F0F;">&#x4E09;&#x3001;&#x4E09;&#x5927;&#x8303;&#x5F0F;</h1>
<ol>
<li>&#x7B2C;&#x4E00;&#x8303;&#x5F0F; &#x539F;&#x5B50;&#x6027;&#xFF0C;&#x5C5E;&#x6027;&#x4E0D;&#x53EF;&#x518D;&#x5206;</li>
<li>&#x7B2C;&#x4E8C;&#x8303;&#x5F0F; &#x4E3B;&#x952E;&#xFF0C;&#x975E;&#x4E3B;&#x5C5E;&#x6027;&#x9700;&#x5B8C;&#x5168;&#x4F9D;&#x8D56;&#x4E8E;&#x4E3B;&#x952E;&#xFF08;&#x6D88;&#x9664;&#x90E8;&#x5206;&#x4F9D;&#x8D56;&#xFF0C;&#x53BB;&#x6389;&#x8054;&#x5408;&#x4E3B;&#x952E;&#xFF09;</li>
<li>&#x7B2C;&#x4E09;&#x8303;&#x5F0F; &#x5C5E;&#x6027;&#x4E0D;&#x4F9D;&#x8D56;&#x4E8E;&#x5176;&#x5B83;&#x975E;&#x4E3B;&#x5C5E;&#x6027;&#xFF08;&#x6D88;&#x9664;&#x4F20;&#x9012;&#x4F9D;&#x8D56;&#xFF09;</li>
</ol>
<h1 id="&#x56DB;&#x3001;&#x96C6;&#x5408;&#x8FD0;&#x7B97;">&#x56DB;&#x3001;&#x96C6;&#x5408;&#x8FD0;&#x7B97;</h1>
<p><strong>Union&#x548C;UnionAll&#x7684;&#x533A;&#x522B;</strong></p>
<ol>
<li>Union&#xFF1A;&#x5BF9;&#x4E24;&#x4E2A;&#x7ED3;&#x679C;&#x96C6;&#x8FDB;&#x884C;&#x5E76;&#x96C6;&#x64CD;&#x4F5C;&#xFF0C;&#x4E0D;&#x5305;&#x62EC;&#x91CD;&#x590D;&#x884C;&#xFF0C;&#x540C;&#x65F6;&#x8FDB;&#x884C;&#x9ED8;&#x8BA4;&#x89C4;&#x5219;&#x7684;&#x6392;&#x5E8F;&#xFF1B; </li>
<li>Union All&#xFF1A;&#x5BF9;&#x4E24;&#x4E2A;&#x7ED3;&#x679C;&#x96C6;&#x8FDB;&#x884C;&#x5E76;&#x96C6;&#x64CD;&#x4F5C;&#xFF0C;&#x5305;&#x62EC;&#x91CD;&#x590D;&#x884C;&#xFF0C;&#x4E0D;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#xFF1B; </li>
</ol>
<h1 id="&#x4E94;&#x3001;&#x8FDE;&#x63A5;&#x8FD0;&#x7B97;">&#x4E94;&#x3001;&#x8FDE;&#x63A5;&#x8FD0;&#x7B97;</h1>
<ol>
<li>left join(&#x5DE6;&#x8054;&#x63A5;)      &#x8FD4;&#x56DE;&#x5305;&#x62EC;&#x5DE6;&#x8868;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x8BB0;&#x5F55;&#x548C;&#x53F3;&#x8868;&#x4E2D;&#x8054;&#x7ED3;&#x5B57;&#x6BB5;&#x76F8;&#x7B49;&#x7684;&#x8BB0;&#x5F55; </li>
<li>right join(&#x53F3;&#x8054;&#x63A5;)      &#x8FD4;&#x56DE;&#x5305;&#x62EC;&#x53F3;&#x8868;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x8BB0;&#x5F55;&#x548C;&#x5DE6;&#x8868;&#x4E2D;&#x8054;&#x7ED3;&#x5B57;&#x6BB5;&#x76F8;&#x7B49;&#x7684;&#x8BB0;&#x5F55;</li>
<li>inner join(&#x7B49;&#x503C;&#x8FDE;&#x63A5;) &#x53EA;&#x8FD4;&#x56DE;&#x4E24;&#x4E2A;&#x8868;&#x4E2D;&#x8054;&#x7ED3;&#x5B57;&#x6BB5;&#x76F8;&#x7B49;&#x7684;&#x884C;</li>
</ol>
<h1 id="&#x516D;&#x3001;&#x7D22;&#x5F15;">&#x516D;&#x3001;&#x7D22;&#x5F15;</h1>
<p>&#x7D22;&#x5F15;&#x662F;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x975E;&#x5E38;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5B83;&#x662F;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x80FD;&#x591F;&#x5FEB;&#x901F;&#x5B9A;&#x4F4D;&#x8BB0;&#x5F55;&#x7684;&#x79D8;&#x5BC6;&#x6B66;&#x5668;&#xFF0C;&#x5BF9;&#x4E8E;&#x63D0;&#x5347;&#x6570;&#x636E;&#x5E93;&#x7684;&#x6027;&#x80FD;&#x3001;&#x51CF;&#x8F7B;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#x5668;&#x7684;&#x8D1F;&#x62C5;&#x6709;&#x7740;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x4F5C;&#x7528;&#xFF1B;<strong>&#x7D22;&#x5F15;&#x4F18;&#x5316;&#x662F;&#x5BF9;&#x67E5;&#x8BE2;&#x6027;&#x80FD;&#x4F18;&#x5316;&#x7684;&#x6700;&#x6709;&#x6548;&#x624B;&#x6BB5;</strong>&#xFF0C;&#x5B83;&#x80FD;&#x591F;&#x8F7B;&#x677E;&#x5730;&#x5C06;&#x67E5;&#x8BE2;&#x7684;&#x6027;&#x80FD;&#x63D0;&#x9AD8;&#x51E0;&#x4E2A;&#x6570;&#x91CF;&#x7EA7;&#x3002;</p>
<p>Innodb&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x5728;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x4F7F;&#x7528;B+&#x6811;&#x7B80;&#x5386;&#x7D22;&#x5F15;&#xFF0C;&#x4F46;&#x662F;B+&#x6811;&#x7D22;&#x5F15;&#x5E76;&#x4E0D;&#x80FD;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x7ED9;&#x5B9A;&#x952E;&#x5BF9;&#x5E94;&#x7684;&#x5177;&#x4F53;&#x503C;&#xFF0C;&#x5B83;&#x53EA;&#x80FD;&#x627E;&#x5230;&#x6570;&#x636E;&#x884C;&#x5BF9;&#x5E94;&#x7684;&#x9875;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x6574;&#x4E2A;&#x9875;&#x8BFB;&#x8FDB;&#x5185;&#x5B58;&#xFF0C;&#x5E76;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x67E5;&#x627E;&#x5177;&#x4F53;&#x7684;&#x6570;&#x636E;&#x884C;&#x3002;</p>
<h2 id="&#x805A;&#x96C6;&#x7D22;&#x5F15;&#x548C;&#x8F85;&#x52A9;&#x7D22;&#x5F15;">&#x805A;&#x96C6;&#x7D22;&#x5F15;&#x548C;&#x8F85;&#x52A9;&#x7D22;&#x5F15;</h2>
<p>&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684; B+ &#x6811;&#x7D22;&#x5F15;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x805A;&#x96C6;&#x7D22;&#x5F15;&#xFF08;clustered index&#xFF09;&#x548C;&#x8F85;&#x52A9;&#x7D22;&#x5F15;&#xFF08;secondary index&#xFF09;&#xFF0C;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x6700;&#x5927;&#x533A;&#x522B;&#x5C31;&#x662F;&#xFF0C;&#x805A;&#x96C6;&#x7D22;&#x5F15;&#x4E2D;&#x5B58;&#x653E;&#x7740;<strong>&#x4E00;&#x6761;&#x884C;&#x8BB0;&#x5F55;&#x7684;&#x5168;&#x90E8;&#x4FE1;&#x606F;</strong>&#xFF0C;&#x800C;&#x8F85;&#x52A9;&#x7D22;&#x5F15;&#x4E2D;&#x53EA;&#x5305;&#x542B;&#x7D22;&#x5F15;&#x5217;&#x548C;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;<strong>&#x67E5;&#x627E;&#x5BF9;&#x5E94;&#x884C;&#x8BB0;&#x5F55;&#x7684;&#x300E;&#x4E66;&#x7B7E;&#x300F;</strong>&#x3002;</p>
<p><strong>&#x805A;&#x96C6;&#x7D22;&#x5F15;</strong></p>
<ol>
<li>InnoDB  &#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x4E2D;&#x7684;&#x8868;&#x90FD;&#x662F;&#x4F7F;&#x7528;&#x7D22;&#x5F15;&#x7EC4;&#x7EC7;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6309;&#x7167;&#x952E;&#x7684;&#x987A;&#x5E8F;&#x5B58;&#x653E;&#xFF1B;&#x805A;&#x96C6;&#x7D22;&#x5F15;&#x5C31;&#x662F;&#x6309;&#x7167;&#x8868;&#x4E2D;&#x4E3B;&#x952E;&#x7684;&#x987A;&#x5E8F;&#x6784;&#x5EFA;&#x4E00;&#x9897; B+ &#x6811;&#xFF0C;&#x5E76;&#x5728;&#x53F6;&#x8282;&#x70B9;&#x4E2D;&#x5B58;&#x653E;&#x8868;&#x4E2D;&#x7684;&#x884C;&#x8BB0;&#x5F55;&#x6570;&#x636E;&#x3002;</li>
<li>&#x4E00;&#x822C;&#x9ED8;&#x8BA4;B+ &#x6811;&#x4F1A;&#x4F7F;&#x7528;&#x8868;&#x7684; id&#xFF08;&#x4E3B;&#x952E;&#xFF09;&#x4F5C;&#x4E3A;&#x805A;&#x96C6;&#x7D22;&#x5F15;&#x7684;&#x952E;&#xFF0C;&#x5E76;&#x5728;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x4E2D;&#x5B58;&#x50A8;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x4FE1;&#x606F;&#x3002;</li>
<li>&#x6B63;&#x5E38;&#x7684;&#x8868;&#x5E94;&#x8BE5;<strong>&#x6709;&#x4E14;&#x4EC5;&#x6709;&#x4E00;&#x4E2A;&#x805A;&#x96C6;&#x7D22;&#x5F15;</strong>&#xFF08;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x90FD;&#x662F;&#x4E3B;&#x952E;&#xFF09;&#xFF0C;&#x8868;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x884C;&#x8BB0;&#x5F55;&#x6570;&#x636E;&#x90FD;&#x662F;&#x6309;&#x7167;&#x805A;&#x96C6;&#x7D22;&#x5F15;&#x7684;&#x987A;&#x5E8F;&#x5B58;&#x653E;&#x7684;&#x3002;</li>
<li>&#x5F53;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x805A;&#x96C6;&#x7D22;&#x5F15;&#x5BF9;&#x8868;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x68C0;&#x7D22;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x83B7;&#x5F97;&#x805A;&#x96C6;&#x7D22;&#x5F15;&#x6240;&#x5BF9;&#x5E94;&#x7684;&#x6574;&#x6761;&#x884C;&#x8BB0;&#x5F55;&#x6570;&#x636E;&#x6240;&#x5728;&#x7684;&#x9875;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x7B2C;&#x4E8C;&#x6B21;&#x64CD;&#x4F5C;&#x3002;</li>
</ol>
<p><strong>&#x975E;&#x805A;&#x96C6;&#x7D22;&#x5F15;&#xFF08;&#x8F85;&#x52A9;&#x7D22;&#x5F15;&#xFF09;</strong></p>
<p>&#x6570;&#x636E;&#x5E93;&#x5C06;&#x6240;&#x6709;&#x7684;&#x975E;&#x805A;&#x96C6;&#x7D22;&#x5F15;&#x90FD;&#x5212;&#x5206;&#x4E3A;&#x8F85;&#x52A9;&#x7D22;&#x5F15;&#xFF1B;&#x8F85;&#x52A9;&#x7D22;&#x5F15;&#x4E5F;&#x662F;&#x901A;&#x8FC7; B+ &#x6811;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x7684;&#x53F6;&#x8282;&#x70B9;&#x5E76;&#x4E0D;&#x5305;&#x542B;&#x884C;&#x8BB0;&#x5F55;&#x7684;&#x5168;&#x90E8;&#x6570;&#x636E;&#xFF0C;&#x4EC5;&#x5305;&#x542B;&#x7D22;&#x5F15;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x952E;&#x548C;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x67E5;&#x627E;&#x5BF9;&#x5E94;&#x884C;&#x8BB0;&#x5F55;&#x7684;&#x300E;&#x4E66;&#x7B7E;&#x300F;&#xFF0C;&#x5728; InnoDB &#x4E2D;&#x8FD9;&#x4E2A;&#x4E66;&#x7B7E;&#x5C31;&#x662F;&#x5F53;&#x524D;&#x8BB0;&#x5F55;&#x7684;&#x4E3B;&#x952E;&#x3002;</p>
<p>&#x8F85;&#x52A9;&#x7D22;&#x5F15;&#x7684;&#x5B58;&#x5728;&#x5E76;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x805A;&#x96C6;&#x7D22;&#x5F15;&#xFF0C;&#x56E0;&#x4E3A;&#x805A;&#x96C6;&#x7D22;&#x5F15;&#x6784;&#x6210;&#x7684; B+ &#x6811;&#x662F;&#x6570;&#x636E;&#x5B9E;&#x9645;&#x5B58;&#x50A8;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x800C;&#x8F85;&#x52A9;&#x7D22;&#x5F15;&#x53EA;&#x7528;&#x4E8E;&#x52A0;&#x901F;&#x6570;&#x636E;&#x7684;&#x67E5;&#x627E;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x5F20;&#x8868;&#x4E0A;&#x5F80;&#x5F80;&#x6709;&#x591A;&#x4E2A;&#x8F85;&#x52A9;&#x7D22;&#x5F15;&#x4EE5;&#x6B64;&#x6765;&#x63D0;&#x5347;&#x6570;&#x636E;&#x5E93;&#x7684;&#x6027;&#x80FD;&#x3002;</p>
<h1 id="&#x4E03;&#x3001;&#x9501;">&#x4E03;&#x3001;&#x9501;</h1>
<p><strong>1&#x3001;&#x60B2;&#x89C2;&#x9501;</strong></p>
<p>&#x60B2;&#x89C2;&#x9501;&#x662F;&#x4E00;&#x79CD;&#x771F;&#x6B63;&#x7684;&#x9501;&#x4E86;&#xFF0C;&#x5B83;&#x4F1A;&#x5728;&#x83B7;&#x53D6;&#x8D44;&#x6E90;&#x524D;&#x5BF9;&#x8D44;&#x6E90;&#x8FDB;&#x884C;&#x52A0;&#x9501;&#xFF0C;&#x786E;&#x4FDD;&#x540C;&#x4E00;&#x65F6;&#x523B;&#x53EA;&#x6709;&#x6709;&#x9650;&#x7684;&#x7EBF;&#x7A0B;&#x80FD;&#x591F;&#x8BBF;&#x95EE;&#x8BE5;&#x8D44;&#x6E90;&#xFF0C;&#x5176;&#x4ED6;&#x60F3;&#x8981;&#x5C1D;&#x8BD5;&#x83B7;&#x53D6;&#x8D44;&#x6E90;&#x7684;&#x64CD;&#x4F5C;&#x90FD;&#x4F1A;&#x8FDB;&#x5165;&#x7B49;&#x5F85;&#x72B6;&#x6001;&#xFF0C;&#x76F4;&#x5230;&#x8BE5;&#x7EBF;&#x7A0B;&#x5B8C;&#x6210;&#x4E86;&#x5BF9;&#x8D44;&#x6E90;&#x7684;&#x64CD;&#x4F5C;&#x5E76;&#x4E14;&#x91CA;&#x653E;&#x4E86;&#x9501;&#x540E;&#xFF0C;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x624D;&#x80FD;&#x91CD;&#x65B0;&#x64CD;&#x4F5C;&#x8D44;&#x6E90;&#xFF1B;</p>
<p><strong>2&#x3001;&#x4E50;&#x89C2;&#x9501;</strong></p>
<p>&#x4E50;&#x89C2;&#x9501;&#x662F;&#x4E00;&#x79CD;&#x601D;&#x60F3;&#xFF0C;&#x5B83;&#x5176;&#x5B9E;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x79CD;&#x771F;&#x6B63;&#x7684;&#x300E;&#x9501;&#x300F;&#xFF0C;&#x5B83;&#x4F1A;&#x5148;&#x5C1D;&#x8BD5;&#x5BF9;&#x8D44;&#x6E90;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#xFF0C;&#x5728;&#x5199;&#x56DE;&#x65F6;&#x5224;&#x65AD;&#x8D44;&#x6E90;&#x662F;&#x5426;&#x8FDB;&#x884C;&#x4E86;&#x6539;&#x53D8;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x53D1;&#x751F;&#x6539;&#x53D8;&#x5C31;&#x4F1A;&#x5199;&#x56DE;&#xFF0C;&#x5426;&#x5219;&#x5C31;&#x4F1A;&#x8FDB;&#x884C;&#x91CD;&#x8BD5;&#xFF0C;&#x5728;&#x6574;&#x4E2A;&#x7684;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x5176;&#x5B9E;&#x90FD;&#x6CA1;&#x6709;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x8FDB;&#x884C;&#x52A0;&#x9501;&#xFF1B;</p>
<p><strong>3&#x3001;&#x8BFB;&#x5199;&#x9501;</strong></p>
<ul>
<li><strong>&#x5171;&#x4EAB;&#x9501;&#xFF08;&#x8BFB;&#x9501;&#xFF09;</strong>&#xFF1A;&#x5141;&#x8BB8;&#x4E8B;&#x52A1;&#x5BF9;&#x4E00;&#x6761;&#x884C;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x8BFB;&#x53D6;&#xFF1B;</li>
<li><strong>&#x4E92;&#x65A5;&#x9501;&#xFF08;&#x5199;&#x9501;&#xFF09;</strong>&#xFF1A;&#x5141;&#x8BB8;&#x4E8B;&#x52A1;&#x5BF9;&#x4E00;&#x6761;&#x884C;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x5220;&#x9664;&#x6216;&#x66F4;&#x65B0;&#xFF1B;</li>
</ul>
<p>&#x5171;&#x4EAB;&#x9501;&#x4E4B;&#x95F4;&#x662F;&#x517C;&#x5BB9;&#x7684;&#xFF0C;&#x800C;&#x4E92;&#x65A5;&#x9501;&#x4E0E;&#x5176;&#x4ED6;&#x4EFB;&#x610F;&#x9501;&#x90FD;&#x4E0D;&#x517C;&#x5BB9;&#xFF1A;&#x56E0;&#x4E3A;&#x5171;&#x4EAB;&#x9501;&#x4EE3;&#x8868;&#x4E86;&#x8BFB;&#x64CD;&#x4F5C;&#x3001;&#x4E92;&#x65A5;&#x9501;&#x4EE3;&#x8868;&#x4E86;&#x5199;&#x64CD;&#x4F5C;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5E76;&#x884C;&#x8BFB;&#xFF0C;&#x4F46;&#x662F;&#x53EA;&#x80FD;&#x4E32;&#x884C;&#x5199;&#xFF0C;&#x53EA;&#x6709;&#x8FD9;&#x6837;&#x624D;&#x80FD;&#x4FDD;&#x8BC1;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x7EBF;&#x7A0B;&#x7ADE;&#x4E89;&#xFF0C;&#x5B9E;&#x73B0;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x3002;</p>
<p><strong>4&#x3001;&#x610F;&#x5411;&#x9501;</strong></p>
<p>&#x4E3A;&#x4E86;&#x652F;&#x6301;&#x591A;&#x7C92;&#x5EA6;&#x9501;&#x5B9A;&#xFF0C;InnoDB &#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x5F15;&#x5165;&#x4E86;&#x610F;&#x5411;&#x9501;&#xFF08;Intention Lock&#xFF09;&#xFF0C;&#x610F;&#x5411;&#x9501;&#x5C31;&#x662F;&#x4E00;&#x79CD;&#x8868;&#x7EA7;&#x9501;&#x3002;</p>
<ul>
<li><strong>&#x610F;&#x5411;&#x5171;&#x4EAB;&#x9501;</strong>&#xFF1A;&#x4E8B;&#x52A1;&#x60F3;&#x8981;&#x5728;&#x83B7;&#x5F97;&#x8868;&#x4E2D;&#x67D0;&#x4E9B;&#x8BB0;&#x5F55;&#x7684;&#x5171;&#x4EAB;&#x9501;&#xFF0C;&#x9700;&#x8981;&#x5728;&#x8868;&#x4E0A;&#x5148;&#x52A0;&#x610F;&#x5411;&#x5171;&#x4EAB;&#x9501;&#xFF1B;</li>
<li><strong>&#x610F;&#x5411;&#x4E92;&#x65A5;&#x9501;</strong>&#xFF1A;&#x4E8B;&#x52A1;&#x60F3;&#x8981;&#x5728;&#x83B7;&#x5F97;&#x8868;&#x4E2D;&#x67D0;&#x4E9B;&#x8BB0;&#x5F55;&#x7684;&#x4E92;&#x65A5;&#x9501;&#xFF0C;&#x9700;&#x8981;&#x5728;&#x8868;&#x4E0A;&#x5148;&#x52A0;&#x610F;&#x5411;&#x4E92;&#x65A5;&#x9501;&#xFF1B;</li>
</ul>
<p>&#x610F;&#x5411;&#x9501;&#x5176;&#x5B9E;&#x4E0D;&#x4F1A;&#x963B;&#x585E;&#x5168;&#x8868;&#x626B;&#x63CF;&#x4E4B;&#x5916;&#x7684;&#x4EFB;&#x4F55;&#x8BF7;&#x6C42;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x4E3B;&#x8981;&#x76EE;&#x7684;&#x662F;&#x4E3A;&#x4E86;&#x8868;&#x793A;&#x662F;&#x5426;&#x6709;&#x4EBA;&#x8BF7;&#x6C42;&#x9501;&#x5B9A;&#x8868;&#x4E2D;&#x7684;&#x67D0;&#x4E00;&#x884C;&#x6570;&#x636E;&#x3002;</p>
<blockquote>
<p><em>&#x6709;&#x7684;&#x4EBA;&#x53EF;&#x80FD;&#x4F1A;&#x5BF9;&#x610F;&#x5411;&#x9501;&#x7684;&#x76EE;&#x7684;&#x5E76;&#x4E0D;&#x662F;&#x5B8C;&#x5168;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x8FD9;&#x91CC;&#x53EF;&#x4EE5;&#x4E3E;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x610F;&#x5411;&#x9501;&#xFF0C;&#x5F53;&#x5DF2;&#x7ECF;&#x6709;&#x4EBA;&#x4F7F;&#x7528;&#x884C;&#x9501;&#x5BF9;&#x8868;&#x4E2D;&#x7684;&#x67D0;&#x4E00;&#x884C;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#x8981;&#x5BF9;&#x5168;&#x8868;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x9700;&#x8981;&#x5BF9;&#x6240;&#x6709;&#x7684;&#x884C;&#x662F;&#x5426;&#x88AB;&#x9501;&#x5B9A;&#x8FDB;&#x884C;&#x626B;&#x63CF;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6548;&#x7387;&#x662F;&#x975E;&#x5E38;&#x4F4E;&#x7684;&#xFF1B;&#x4E0D;&#x8FC7;&#xFF0C;&#x5728;&#x5F15;&#x5165;&#x610F;&#x5411;&#x9501;&#x4E4B;&#x540E;&#xFF0C;&#x5F53;&#x6709;&#x4EBA;&#x4F7F;&#x7528;&#x884C;&#x9501;&#x5BF9;&#x8868;&#x4E2D;&#x7684;&#x67D0;&#x4E00;&#x884C;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x4E4B;&#x524D;&#xFF0C;&#x4F1A;&#x5148;&#x4E3A;&#x8868;&#x6DFB;&#x52A0;&#x610F;&#x5411;&#x4E92;&#x65A5;&#x9501;&#xFF08;<strong>IX</strong>&#xFF09;&#xFF0C;&#x518D;&#x4E3A;&#x884C;&#x8BB0;&#x5F55;&#x6DFB;&#x52A0;&#x4E92;&#x65A5;&#x9501;&#xFF08;<strong>X</strong>&#xFF09;&#xFF0C;&#x5728;&#x8FD9;&#x65F6;&#x5982;&#x679C;&#x6709;&#x4EBA;&#x5C1D;&#x8BD5;&#x5BF9;&#x5168;&#x8868;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x5224;&#x65AD;&#x8868;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x884C;&#x6570;&#x636E;&#x662F;&#x5426;&#x88AB;&#x52A0;&#x9501;&#x4E86;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x7B49;&#x5F85;&#x610F;&#x5411;&#x4E92;&#x65A5;&#x9501;&#x88AB;&#x91CA;&#x653E;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;</em></p>
</blockquote>
<p><strong>5&#x3001;&#x4E24;&#x9636;&#x6BB5;&#x9501;</strong></p>
<p><strong>6&#x3001;&#x4E09;&#x9636;&#x6BB5;&#x9501;</strong></p>
<h1 id="&#x53C2;&#x8003;&#x6587;&#x7AE0;">&#x53C2;&#x8003;&#x6587;&#x7AE0;</h1>
<ol>
<li><a href="https://segmentfault.com/a/1190000016566788" target="_blank">mysql      &#x5E7B;&#x8BFB;&#x7684;&#x8BE6;&#x89E3;&#x3001;&#x5B9E;&#x4F8B;&#x53CA;&#x89E3;&#x51B3;&#x529E;&#x6CD5;</a></li>
<li><a href="https://guoyang1996.github.io/zookeeper1/" target="_blank">&#x300A;&#x4ECE;Paxos&#x5230;Zookeeper&#x300B;&#x8BFB;&#x4E66;&#x7B14;&#x8BB0;&#xFF08;&#x4E00;&#xFF09;</a></li>
<li><a href="https://draveness.me/mysql-innodb" target="_blank">&#x300E;&#x6D45;&#x5165;&#x6D45;&#x51FA;&#x300F;MySQL &#x548C; InnoDB</a></li>
</ol>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="0-数据库.html" class="navigation navigation-prev " aria-label="Previous page: 数据库">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../ch3-spring/0-spring.html" class="navigation navigation-next " aria-label="Next page: Spring">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"typora-root-url":".","typora-copy-images-to":"..\\assets\\img","title":"1-数据库基础","level":"1.3.1","depth":2,"next":{"title":"Spring","level":"1.4","depth":1,"path":"ch3-spring/0-spring.md","ref":"./ch3-spring/0-spring.md","articles":[{"title":"1-Spring基础知识","level":"1.4.1","depth":2,"path":"ch3-spring/1-spring基础.md","ref":"./ch3-spring/1-spring基础.md","articles":[]}]},"previous":{"title":"数据库","level":"1.3","depth":1,"path":"ch2-database/0-数据库.md","ref":"./ch2-database/0-数据库.md","articles":[{"title":"1-数据库基础","level":"1.3.1","depth":2,"path":"ch2-database/1-数据库基础.md","ref":"./ch2-database/1-数据库基础.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"ch2-database/1-数据库基础.md","mtime":"2019-07-30T11:22:07.125Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-09-19T07:51:46.510Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

